#include "pch.h"
#include "Equipment.h"
#include "Item.h"

/*---------------------------------------------------------------------------------------------
이름     : Equipment::Add
용도     : 장비창에 아이템을 추가하는 함수
수정자   : 이민규
수정날짜 : 2022.10.28
----------------------------------------------------------------------------------------------*/
void Equipment::Add(Item* item)
{
	_Items.insert({ item->GetItemDbID() , item });
}

/*---------------------------------------------------------------------------------------------
이름     : Equipment::Erase
용도     : 장비창에 아이템을 제거하는 함수
수정자   : 이민규
수정날짜 : 2022.10.28
----------------------------------------------------------------------------------------------*/
void Equipment::Erase(Item* item)
{
	_Items.erase(item->GetItemDbID());
}

/*---------------------------------------------------------------------------------------------
이름     : Equipment::Find
용도     : 장비창 있는 아이템을 가져오는 함수
		   없을 경우 nullptr 반환
수정자   : 이민규
수정날짜 : 2022.10.28
----------------------------------------------------------------------------------------------*/
Item* Equipment::Find(int32 itemdbid)
{
	auto item = _Items.find(itemdbid);

	if (item == _Items.end())
		return nullptr;

	return item->second;
}

/*---------------------------------------------------------------------------------------------
이름     : Equipment::FindCondition
용도     : 장비창에 있는 아이템을 조건식에 따라 가져오는 함수
		   없을 경우 nullptr 반환
수정자   : 이민규
수정날짜 : 2022.10.19
----------------------------------------------------------------------------------------------*/
Item* Equipment::FindCondition(function<bool(Item*)> condition)
{
	for (auto& item : _Items)
		if (condition(item.second))
			return item.second;

	return nullptr;
}
