#include "pch.h"
#include "JobQueue_Queue.h"

/*---------------------------------------------------------------------------------------------
이름     : JobQueue::Push
용도     : JobQueues에 데이터를 넣는  함수
수정자   : 이민규
수정날짜 : 2022.09.01
----------------------------------------------------------------------------------------------*/
void JobQueue_Queue::Push(shared_ptr<JobQueue> jobqueue)
{
	_jobQueues.Push(jobqueue);
}

/*---------------------------------------------------------------------------------------------
이름     : JobQueue_Queue::Pop
용도     : JobQueues에서 데이터를 반환하는 함수
수정자   : 이민규
수정날짜 : 2022.09.01
----------------------------------------------------------------------------------------------*/
shared_ptr<JobQueue> JobQueue_Queue::Pop()
{
	return _jobQueues.Pop();
}
