#include "pch.h"
#include "JobSerializer.h"

/*---------------------------------------------------------------------------------------------
이름     : JobSerializer::Push
용도     : JobQueues에 데이터를 넣는  함수
수정자   : 이민규
수정날짜 : 2022.10.05
----------------------------------------------------------------------------------------------*/
void JobSerializer::Push(shared_ptr<JobQueue> jobqueue)
{
	_jobQueues.Push(jobqueue);
}

/*---------------------------------------------------------------------------------------------
이름     : JobSerializer::Pop
용도     : JobQueues에서 데이터를 반환하는 함수
수정자   : 이민규
수정날짜 : 2022.10.05
----------------------------------------------------------------------------------------------*/
shared_ptr<JobQueue> JobSerializer::Pop()
{
	return _jobQueues.Pop();
}
